/**********************************************************************
 *
 *     ＢＭＬ様向け検査システム
 *
 *     システム名：次世代
 *     ファイル名：GD105Kkaconvknr.h
 *     機能概要  ：結果変換管理情報アクセス関数(報告処理)
 *
 **********************************************************************/

/**********************************************************************
 *  Ver.     Date           Name           History
 * --------------------------------------------------------------------
 *  1.00     2009-05-11                    Create
 **********************************************************************/
#ifndef _GD105Kkaconvknr_h_
#define _GD105Kkaconvknr_h_

/********************************************************************/
/*  インクルード宣言                                                */
/********************************************************************/
#include "bml_DBCom.h"

/********************************************************************/
/* テーブル構造体定義                                               */
/********************************************************************/
typedef struct _Kkaconvknr {
	char		knskisymd[10+1];	/* 検査開始日     */
	char		sriymd[10+1];		/* 処理日         */
	char		kntno[13+1];		/* 検体No         */
	char		knsgrp[16+1];		/* 検査グループ   */
	char		kmkcd[7+1];			/* 項目コード     */
	short		knssu;				/* 検査回数       */
	short		hkksu;				/* 報告回数       */
	char		sstcd[7+1];			/* 施設コード     */
	sqlint32	no;					/* No             */
	char		utkymd[10+1];		/* 受付日         */
	char		irino[11+1];		/* 依頼書No       */
	char		knskka1[12+1];		/* 検査結果１     */
	char		knskka2[24+1];		/* 検査結果２     */
	char		knskka2kbn[2+1];	/* 検査結果２区分 */
	char		kkahskcd[3+1];		/* 検査結果補足   */
	char		skkka[24+1];		/* 照会結果       */
	char		sbtkbn;				/* 性別区分       */
	char		age[3+1];			/* 年齢           */
	char		agekbn;				/* 年齢区分       */
	char		sc[5+1];			/* 身長           */
	char		tj[5+1];			/* 体重           */
	char		tjtni;				/* 体重区分       */
	char		tntme[4+1];			/* 蓄尿時間       */
	char		tntni;				/* 蓄尿時間区分   */
	char		tnryo[5+1];			/* 蓄尿量         */
	char		tnryotni;			/* 蓄尿量区分     */
	char		hnktntid[8+1];		/* 変更担当者ＩＤ */
	char		ksndh[26+1];		/* 情報更新日時   */
}	Kkaconvknr;

/******************************************************************************/
/* プロトタイプ宣言                                                           */
/******************************************************************************/
#ifdef __cplusplus
extern "C" {
#endif

long dGD105InsKkaconvknr( Kkaconvknr* arrayIn );

#ifdef __cplusplus
}
#endif

#endif
/** End of File *********************************************************/
