/**********************************************************************
 *
 *     ＢＭＬ様向け検査システム
 *
 *     システム名：次世代
 *     ファイル名：GD105Kkaconvmst.h
 *     機能概要  ：結果変換マスタアクセス関数(報告処理)
 *
 **********************************************************************/

/**********************************************************************
 *  Ver.     Date           Name           History
 * --------------------------------------------------------------------
 *  1.00     2009-05-11                    Create
 **********************************************************************/
#ifndef _GD105Kkaconvmst_h_
#define _GD105Kkaconvmst_h_

/********************************************************************/
/*  インクルード宣言                                                */
/********************************************************************/
#include "bml_DBCom.h"

/********************************************************************/
/* テーブル構造体定義                                               */
/********************************************************************/
typedef struct _Kkaconvmst {
	char    knsgrp[16+1];
	char    kmkcd[7+1];
	char    sstcd[7+1];
	int     no;
	char    sbtkbn;
	char    age[32+1];
	char    agekbn;
	char    sc[32+1];
	char    tj[32+1];
	char    tjtni;
	char    tntme[32+1];
	char    tntni;
	char    tnryo[32+1];
	char    tnryotni;
	char    knskka1[12+1];
	char    knskka2[24+1];
	char    knskka2kbn[2+1];
	char    kkahskcd[3+1];
	char    hjkka[24+1];
	char    kaiymd[10+1];
	char    haiymd[10+1];
	char    hnktntid[8+1];
	char    ksndh[26+1];
}	Kkaconvmst;

/******************************************************************************/
/* プロトタイプ宣言                                                           */
/******************************************************************************/
#ifdef __cplusplus
extern "C" {
#endif

long mGD105_KKACONVMST_SelAll( Kkaconvmst** arrayOut, int* numOut );

#ifdef __cplusplus
}
#endif

#endif
/** End of File *********************************************************/
