/************************************************************************/
/*																		*/
/*		ＢＭＬ様向け検査システム										*/
/*																		*/
/*		システム名：次世代												*/
/*		ファイル名：bml_db.c											*/
/*		概要      ：データベース関連の共通関数							*/
/*																		*/
/************************************************************************/

/************************************************************************/
/*	Ver.	日付			名前			修正内容					*/
/* --------------------------------------------------------------------	*/
/*	1.00	2005/06/14		E.Osada			Create						*/
/************************************************************************/

/************************************************************************/
/*	インクルード宣言													*/
/************************************************************************/
#include <string.h>
#include "bml_db.h"

/************************************************************************/
/*	関数名		：ZbmlStripCopy()										*/
/*	機能概要	：末尾の全角・半角のwｻwﾋwﾝwｮwｻを取りながら文字列をCOPYする。	*/
/*	入力																*/
/*	 第１引数	：char *dest    コピー先のメモリーのアドレス。			*/
/*	 第２引数	：char *src     コピー元のメモリーのアドレス。			*/
/*	 第３引数	：SHORT ind     データベースのインディケータ。			*/
/*	出力																*/
/*	 正常：TRUE															*/
/*	 異常：FALSE														*/
/************************************************************************/
BOOL ZbmlStripCopy(char *dest, char *src, SHORT ind)
{
    char *ps, *pd, *last;

	if (NULL == dest || NULL == src){
		return FALSE;
	}

	if (ind < 0){                /* インディケータが ０より小さければ NULL 文字列をセットする。 */
		*dest = 0;
		return TRUE;
	}

    for (ps=src, pd=last=dest; *ps; ps++, pd++){ /* 先頭から順にコピーする。 */
		int c1 = (*ps)&0xff;

		if ((c1 >= 0x81 && c1 <= 0x9f) || 
			(c1 >= 0xe0 && c1 <= 0xfc)){ /* 全角の１バイト目 */
			int c2 = (*(ps+1))&0xff;

			if (c1 != 0x81 || c2 != 0x40){  /* 全角スペースでない */
				last = pd+2;
			}
			*pd++ = *ps++;
			*pd   = *ps;
		}
		else{
			if (*ps != ' '){                      /* 半角スペースでない */ 
				last = pd+1;
			}
			*pd = *ps;
		}
    }

    *last = 0; /* 終り位置に NULL 文字をセットする。 */

    return TRUE;
}

/************************************************************************/
/*	関数名		：ZbmlCopyToHostData									*/
/*	機能概要	：ホスト変数へ文字列wﾁwﾜwｮwｾをCOPYする。長さをwｿwｨwｭwｶする。	*/
/*	入力																*/
/*	 第１引数	：char* hData    文字列用ホスト変数へのポインタ			*/
/*	 第２引数	：char* cData    文字列データへのポインタ				*/
/*	 第３引数	：int   hSize    hData の長さ（バイト数）				*/
/*	出力																*/
/*	 正常：TRUE															*/
/*	 異常：FALSE														*/
/************************************************************************/
BOOL ZbmlCopyToHostData( char* hData, char* cData, int hSize )
{
	if( cData == NULL ) {
		return FALSE;
	}
	if (hData == NULL ) {
		return FALSE;
	}

	if( strlen(cData) > hSize ){
		return FALSE;
	}else{
		memset( hData, '\0', hSize+1 );
		strcpy( hData, cData );
	}
	
	return TRUE;
}
/** End of File *********************************************************/
