/**********************************************************************
 *
 *     ＢＭＬ様向け検査システム
 *
 *     システム名：次世代
 *     ファイル名：LD104Kekka.h
 *     機能概要  ：
 *
 **********************************************************************/

/**********************************************************************
 *  Ver.     Date           Name           History
 * --------------------------------------------------------------------
 **********************************************************************/
#ifndef _LD104Kekka_h_
#define _LD104Kekka_h_

#include "bml_DBCom.h"
#include "LD104Sysknrmst.h"

/*--------------------------------------
// テーブル構造体定義
*/
typedef struct _GetKekka {
    char    utkymd[11];
    char    irino[12];
    char    kmkcd[8];
}   GetKekka;

/*--------------------------------------
 * 関数プロトタイプ
 */
#ifdef __cplusplus
extern "C" {
#endif

long ZdbKekkaLD104Select( char *, GetKekka** arrayOut, int* numOut );

#ifdef __cplusplus
}
#endif

#endif
/** End of File *********************************************************/
