/**********************************************************************
 *
 *     ＢＭＬ様向け検査システム
 *
 *     システム名：次世代
 *     ファイル名：A205irai.h
 *     機能概要  ：依頼情報テーブルアクセス(分注展開用)
 *
 **********************************************************************/

/**********************************************************************
 *  Ver.     Date           Name           History
 * --------------------------------------------------------------------
 *  1.00     2006-02-10                    Create
 *  2.00     2009-01-07     Merits K.Ameno 施設コード増桁 通信仕様変更対応
 **********************************************************************/
#ifndef _A205irai_h_
#define _A205irai_h_

/********************************************************************/
/*  インクルード宣言                                                */
/********************************************************************/
#include "bml_DBCom.h"
#include "Irai.h"

/******************************************************************************/
/* プロトタイプ宣言                                                           */
/******************************************************************************/
long ABunIriSel( Irai* pKey, Irai** arrayOut, int* numOut );
long ABunIridummy( Irai** arrayOut, int* numOut );
long A205insIrai( Irai* );
long ABunIriKmkSel( Irai* pKey, Irai** arrayOut, int* numOut );
long ABunIriKmkCdSel( Irai* pKey, Irai** arrayOut, int* numOut ); /* Ver 2.00 追加 */
#endif
/** End of File *********************************************************/
